app/Controllers/Produk.php

SELECT *
FROM `produk`
WHERE `nama_produk` LIKE '%%' ESCAPE '!'
---
    public function index()
    {
        if (isset($_COOKIE['produk'])) {
            $arr_produk = json_decode($_COOKIE['produk'], true);
        } else {
            $arr_produk = [];
        }

        $pencarian_id_produk = !isset($_GET['cari'])?'':$_GET['cari'];

        $arr_produk = $this->produkModel
        ->like('nama_produk', $pencarian_id_produk)
        ->get();